{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f1conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f1batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 1], [8, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f1elu0__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f1elu0_exp0", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f1elu0__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f1elu0__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f1elu0_where0", 
      "inputs": [[10, 0, 0], [9, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f1conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f1batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 1], [21, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f1elu1__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f1elu1_exp0", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f1elu1__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f1elu1__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f1elu1_where0", 
      "inputs": [[23, 0, 0], [22, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f1conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f1batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f1batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f1elu2__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f1elu2_exp0", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f1elu2__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f1elu2__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f1elu2_where0", 
      "inputs": [[36, 0, 0], [35, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vgg20190317block1_f1pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f2conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f2batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f2elu0__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f2elu0_exp0", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f2elu0__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f2elu0__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f2elu0_where0", 
      "inputs": [[50, 0, 0], [49, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f2conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f2batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 1], [61, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f2elu1__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f2elu1_exp0", 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f2elu1__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f2elu1__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f2elu1_where0", 
      "inputs": [[63, 0, 0], [62, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f2conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f2batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f2batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f2elu2__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f2elu2_exp0", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f2elu2__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f2elu2__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f2elu2_where0", 
      "inputs": [[76, 0, 0], [75, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vgg20190317block1_f2pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f3conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f3batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 1], [88, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f3elu0__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f3elu0_exp0", 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f3elu0__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f3elu0__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f3elu0_where0", 
      "inputs": [[90, 0, 0], [89, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "vgg20190317block1_f3conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_f3batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_f3batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_f3elu1__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_f3elu1_exp0", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_f3elu1__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_f3elu1__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_f3elu1_where0", 
      "inputs": [[103, 0, 0], [102, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vgg20190317block1_f3pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "vgg20190317block1_flatten0_flatten0", 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "vgg20190317block1_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[0, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_fc-1weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "normal", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_fc-1bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "vgg20190317block1_fc-1fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_elu0__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_elu0_exp0", 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_elu0__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_elu0__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_elu0_where0", 
      "inputs": [[119, 0, 0], [118, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_fc-2weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "normal", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_fc-2bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "vgg20190317block1_fc-2fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_elu1__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_elu1_exp0", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_elu1__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_elu1__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_elu1_where0", 
      "inputs": [[132, 0, 0], [131, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_fc-3weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "normal", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_fc-3bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "vgg20190317block1_fc-3fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "vgg20190317block1_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0], [142, 0, 1], [143, 0, 1]]
    }, 
    {
      "op": "_greater_scalar", 
      "name": "vgg20190317block1_elu2__greater_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vgg20190317block1_elu2_exp0", 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "vgg20190317block1_elu2__minusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vgg20190317block1_elu2__mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "vgg20190317block1_elu2_where0", 
      "inputs": [[145, 0, 0], [144, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_predictionsweight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "normal", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg20190317block1_predictionsbias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "vgg20190317block1_predictionsfwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    5, 
    6, 
    7, 
    8, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    42, 
    43, 
    45, 
    46, 
    47, 
    48, 
    55, 
    56, 
    58, 
    59, 
    60, 
    61, 
    68, 
    69, 
    71, 
    72, 
    73, 
    74, 
    82, 
    83, 
    85, 
    86, 
    87, 
    88, 
    95, 
    96, 
    98, 
    99, 
    100, 
    101, 
    111, 
    112, 
    114, 
    115, 
    116, 
    117, 
    124, 
    125, 
    127, 
    128, 
    129, 
    130, 
    137, 
    138, 
    140, 
    141, 
    142, 
    143, 
    150, 
    151
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178
  ], 
  "heads": [[152, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}